lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
/**
 * pipeline.c — Pipeline MVP : UART frame → Mahalanobis → LED + réponse
 *
 * Protocole UART v2 (little-endian, binary) :
 *   Réception : [MAGIC:2B][VERSION:1B][TASK_ID:1B][TIMESTAMP_MS:4B]
 *               [N:1B][features:f32×N][label:1B][FLAGS:1B][CRC8:1B]
 *   Réponse   : [pred:u8][conf:f32][lat_us:u32][ram_b:u16][thr:u16][status:u8] = 14 B
 *
 * Mesure latence via profiling.c (DWT cycle counter).
 */

#include "pipeline.h"
#include "profiling.h"
#include "model_weights.h"
#include "model_weights_rul.h"
#include "model_weights_multiclass.h"
#include "model_weights_ewc.h"
#include "mahalanobis.h"
#include "metrics.h"
#include "tinyol.h"
#include "ewc_head.h"
#include "ewc_head_regression.h"
#include "ewc_head_multiclass.h"
#include "ewc_head_int8.h"
#ifdef EWC_INT8_V2
#include "ewc_head_int8_v2.h"
#include "ewc_head_int8_v2_weights.h"  /* généré (vide par défaut) — S3908 */
#endif
#if defined(EWC_SUBINT8_WEIGHTS_PROVIDED)
/* Sprint 48 (S4804) — tête sub-INT8 (INT4/ternaire/binaire) chargée depuis le header
 * généré (export_weights_c.py --ewc-subint8). Réutilise le kernel v2 (EWCHeadInt8V2 en
 * non-packé, EWCHeadSubInt8Packed sous -DEWC_INTx_PACKED). Le header est vide par défaut
 * → ce bloc n'existe que lorsqu'on flashe volontairement une variante sub-INT8. */
#include "ewc_head_int8_v2.h"
#include "ewc_head_subint8_weights.h"  /* généré (vide par défaut) — S4803 */
/* Garde : le packing du header généré DOIT correspondre au flag de build, sinon les
 * memcpy d'init débordent (int8 non-packé 160 B → conteneur packé 64 B). L'export
 * (--packed) et le build (-DEWC_INTx_PACKED) doivent être cohérents (driver S4804). */
#if defined(EWC_INTx_PACKED)
#if !EWC_SUBINT8_PACKED
#error "Build -DEWC_INTx_PACKED mais header sub-INT8 non-packé : regénérer export_weights_c.py --packed"
#endif
#else
#if EWC_SUBINT8_PACKED
#error "Header sub-INT8 packé mais build sans -DEWC_INTx_PACKED : ajouter -DEWC_INTx_PACKED"
#endif
#endif
#endif
#include "hdc.h"
#include "meta_head.h"
#include "mahalanobis_q15.h"
#include "mahalanobis_q15_weights.h"   /* généré (vide par défaut) — S3407 */
#ifdef MAHA_INT8
#include "mahalanobis_int8.h"
#include "mahalanobis_int8_weights.h"  /* généré (vide par défaut) — S2912 */
#endif
#ifdef EWC_AUTO_UPDATE
#include "drift_detector.h"            /* gate de mise à jour autonome — S3803 */
#include "drift_thresholds.h"          /* généré (neutre par défaut) — S3803 */
#endif
#ifdef DRIFT_DETECT
#include "drift/drift_method.h"        /* détecteurs de drift portés — S4502 */
#include "drift/page_hinkley.h"
#include "drift/ddm.h"
#include "drift/psi.h"
#include "drift_methods_params.h"      /* généré (neutre par défaut) — S4503 */
#endif
#include "stm32f4xx.h"
#include <math.h>
#include <string.h>
#ifdef DEBUG_PRINTF
#include <stdio.h>
#endif

#define PROTO_MAGIC0 0xCDU   /* MAGIC=0xABCD little-endian : octet bas en premier */
#define PROTO_MAGIC1 0xABU
/* Nombre max de features par trame UART — surchargeable au build (S3506).
 * Défaut 16U (conditions 5feat/best ≤ 16). La condition `all`×cmapss (21 capteurs)
 * se construit avec `-DPROTO_MAX_N=21`. Coût .bss : g_stream_storage croît de
 * STREAM_BUF_W*(PROTO_MAX_N-16)*4 octets (à W=5 : +100 B pour 21) ; raw[]/payload[]
 * sont sur la pile. Défaut inchangé ⇒ .bss 5feat bit-identique. */
#ifndef PROTO_MAX_N
#define PROTO_MAX_N  16U
#endif

/* Dimension native des poids placeholder de model_weights.h (générés à 5 par
 * export_weights_c.py — header jamais édité à la main). Si la condition de build
 * change MAHA_DIM/TINYOL_IN, ces tableaux figés ne sont plus copiables → init
 * neutre (maha_init = identité ; TinyOL = .bss à zéro). Les poids réels par
 * condition sont regénérés en S3507. EWC suit déjà EWC_HEAD_WEIGHTS_PROVIDED. */
#ifndef WEIGHTS_NATIVE_DIM
#define WEIGHTS_NATIVE_DIM 5
#endif

/* S3507 : dim native PAR MODÈLE des poids exportés (condition all/best → k≠5,
 * et k peut différer par modèle en `best`). Les headers générés par
 * export_weights_c.py définissent MAHA_NATIVE_DIM (model_weights.h) et
 * EWC_HEAD_NATIVE_DIM (model_weights_ewc.h). Fallback sur WEIGHTS_NATIVE_DIM
 * pour les headers historiques (5feat) → 0 régression. */
#ifndef MAHA_NATIVE_DIM
#define MAHA_NATIVE_DIM WEIGHTS_NATIVE_DIM
#endif
#ifndef EWC_HEAD_NATIVE_DIM
#define EWC_HEAD_NATIVE_DIM WEIGHTS_NATIVE_DIM
#endif
/* S5201 : idem pour TinyOL — TINYOL_NATIVE_DIM est écrit par
 * export_weights_tinyol.py dans model_weights.h. Sans lui, les poids TinyOL
 * n'étaient copiés qu'à TINYOL_IN == 5, laissant l'auto-encodeur à zéro sur
 * toute condition k≠5 (Monitoring 4 feats, all, best). */
#ifndef TINYOL_NATIVE_DIM
#define TINYOL_NATIVE_DIM WEIGHTS_NATIVE_DIM
#endif

/* ── Globals statiques des 3 modèles (S2006 — profiling RAM Gap 2) ─────── */
/* MEM: 128 B @ FP32 en .bss                                               */
MahalanobisDetector g_detector;

/* MEM: TinyOLEncoder ~2.88 Ko @ FP32 + TinyOLDecoder ~2.77 Ko @ FP32 en .bss */
TinyOLEncoder g_tinyol_enc;
TinyOLDecoder g_tinyol_dec;

/* MEM: ~9.5 Ko @ FP32 en .bss */
EWCHead g_ewc_head;

/* MEM: EWCHeadInt8 ~2.4 Ko @ INT8 + ~1.2 Ko biais FP32 en .bss
 * Cf. S2221 — ewc_head_int8.h commentaires MEM détaillés */
EWCHeadInt8 g_ewc_int8;

#ifdef EWC_INT8_V2
/* Sprint 39 (S3915) — tête INT8 v2 : acc int32, scales par-canal + activations calibrées.
 * Sélectionnée à la compilation (-DEWC_INT8_V2) car le nibble protocole est saturé (mirroir
 * -DMAHA_INT8, S2912) : le chemin 0x40 (FRAME_FLAGS_INT8_MODE) exécute le v2 au lieu du v1.
 * Update en ligne (S4002) : SGD sur la tête FP32 maître g_ewc_head puis requantification
 * v2 (les scales par-canal restent la vue quantifiée de g_ewc_head, act_max figé).
 * MEM: EWCHeadInt8V2 ~704 B poids int8 + scales/biais FP32 en .bss. */
EWCHeadInt8V2 g_ewc_int8_v2;
/* act_max de calibration mémorisé à l'init (header EWC_V2_ACT_MAX ou neutre) → réutilisé
 * pour la requantification par échantillon en mode online (S4002). Figé = parité miroir PC. */
static float g_v2_act_max[3] = {1.0f, 1.0f, 1.0f};
#endif

