lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
#if defined(EWC_SUBINT8_WEIGHTS_PROVIDED)
/* Sprint 48 (S4804) — tête sub-INT8 : poids PRÉ-QUANTIFIÉS PC (linéaire INT4 / ternaire /
 * binaire) copiés du header généré. Deux stockages selon le build :
 *   - non-packé (conteneur int8) : .bss ≈ INT8 (nœud d'honnêteté S4800) ;
 *   - packé (-DEWC_INTx_PACKED)  : .bss ÷2/÷4/÷8, dépack au forward (latence DWT S4804).
 * Frozen uniquement (S48 isole le schéma de quantification, pas l'apprentissage online). */
#if defined(EWC_INTx_PACKED)
static EWCHeadSubInt8Packed g_ewc_subint8_packed;
#else
static EWCHeadInt8V2        g_ewc_subint8;
#endif
#endif

/* MEM: HDCClassifier ~27.7 Ko @ FP32 en .bss
 * ATTENTION : avec g_ewc_head (~9.5 Ko) + g_tinyol (~5.7 Ko) + g_detector (~128 B)
 * + g_hdc (~27.7 Ko) = ~43 Ko → dans le budget 64 Ko. */
HDCClassifier g_hdc;

/* Sprint 29 — modèles INT8 firmware (S2901 HDC INT8, S2902 TinyOL INT8) */
HDCInt8           g_hdc_int8;     /* MEM: ~34.8 Ko @ INT8/INT16 en .bss */
TinyOLEncoderInt8 g_tinyol_int8;  /* MEM: ~0.9 Ko @ INT8 + biais FP32 */
OtOHeadInt8       g_oto_int8;     /* MEM: tête OtO INT8 + maîtres FP32 */
/* Buffer encodage HDC INT8 — fichier-scope pour éviter 2 Ko de pile dans pipeline_run. */
static int8_t g_hv_int8[HDC_I_D];   /* MEM: 2 048 B @ INT8 en .bss */

/* ── Instrumentation streaming/buffer (Sprint 34 S3403) ─────────────────────
 * Buffer circulaire générique (ring_buffer.c) alimenté par chaque trame reçue.
 * Sa taille .bss = STREAM_BUF_W * PROTO_MAX_N * sizeof(float) varie avec W (rebuild
 * `make all STREAM_BUF_W=<W>`) → mesurée par arm-none-eabi-size pour l'étude S3403.
 * N'altère PAS le chemin d'inférence par-trame (remplissage observé uniquement). */
#ifndef STREAM_BUF_W
#define STREAM_BUF_W 5
#endif
static float      g_stream_storage[STREAM_BUF_W * PROTO_MAX_N];  /* MEM: W*16*4 B @ FP32 */
static RingBuffer g_stream_rb;

/* MEM: EWCHeadReg ~8.9 Ko @ FP32 en .bss */
EWCHeadReg g_ewc_reg;

/* MEM: EWCHeadMC ~14 Ko @ FP32 en .bss (EWC_MC_N_CLASSES=10) */
EWCHeadMC g_ewc_mc;

/* MEM: MetaHead ~20 B @ FP32 (logreg) en .bss — méta-modèle stacking (Sprint 31) */
MetaHead g_meta;

/* MEM: MahalanobisQ15 = d×1 B (mu int8) + d²×2 B (sigma int16) + 5×4 B (scales/seuils)
 * = 75 B @ d=5 en .bss — Mahalanobis sigma_inv Q15 (MAHA_Q15_MODE, S3407) */
MahalanobisQ15 g_maha_q15;

#ifdef MAHA_INT8
/* MEM: MahalanobisInt8 = d×1 B (mu) + d²×1 B (sigma) + 6×4 B (scales/zp/seuils)
 * = 54 B @ d=5 en .bss — Mahalanobis INT8 affine (S2912, sélection -DMAHA_INT8).
 * Remplace le chemin Mahalanobis par défaut (FP32) ; le nibble de flags étant saturé,
 * la sélection est à la compilation (driver re-flashe par cellule). */
MahalanobisInt8 g_maha_int8;
#endif

#ifdef EWC_AUTO_UPDATE
/* MEM: DriftDetector ≈ DRIFT_WINDOW_MAX×4 B (~256 B) en .bss — gate autonome S3803.
 * Présent uniquement sous -DEWC_AUTO_UPDATE (build par défaut inchangé). */
static DriftDetector g_drift;
static uint32_t      g_n_updates;   /* SGD réellement déclenchés par le gate (mesure board) */
static DriftVerdict  g_last_verdict; /* verdict du dernier échantillon (0=NORMAL,1=FAULT,2=DRIFT) — S3805 */
#endif

#ifdef DRIFT_DETECT
/* S4502 — détecteur de drift porté, sélectionné à la compilation (-DDRIFT_METHOD).
 * Un binaire = une méthode. Présent uniquement sous -DDRIFT_DETECT (build défaut inchangé). */
#if DRIFT_METHOD == DRIFT_PSI
static PSI         g_drift_method;   /* # MEM: (3·PSI_BINS+1)·4 B — branché sur maha_score */
#elif DRIFT_METHOD == DRIFT_DDM
static DDM         g_drift_method;   /* # MEM: ~20 B — flux d'erreur 1[pred!=label] */
#else
static PageHinkley g_drift_method;   /* # MEM: ~16 B — flux d'erreur 1[pred!=label] */
#endif
static DriftMethodVerdict g_drift_method_verdict;  /* dernier verdict (remonté dans snap.auroc) */
static uint32_t           g_drift_method_alarms;   /* nb de DRIFT cumulés (remonté dans snap.forgetting) */
#endif

/* MEM: métriques on-board — 302 B @ SRAM + 16 B OnlineRMSE + ~202 B OnlineF1Macro */
static OnlineAccuracy    g_acc;
static OnlineAUROC       g_auroc;
static ForgettingTracker g_fgt;
static OnlineRMSE        g_rmse;
static OnlineF1Macro     g_f1;
static uint8_t           g_current_task_id;

/* Contexte de la trame courante */
static uint8_t  g_recv_label;
static uint8_t  g_recv_version;
static uint8_t  g_recv_task_id;
static uint32_t g_recv_timestamp_ms;
static uint8_t  g_recv_flags;

/* ── Helpers UART polling (USART3, configuré par hw_uart_init) ─────────── */

#ifndef TEST_MODE
static uint8_t uart_getbyte(void)
{
#ifdef UART_WFI_IDLE
    /* S5302 — attente UART en SOMMEIL au lieu de la scrutation active.
     *
     * Pourquoi : sans cela le cœur tourne à 180 MHz 100 % du temps, y compris entre
     * deux trames, et il n'existe aucune référence « au repos » exploitable — c'est
     * ce qui empêchait le protocole delta de produire des µJ par inférence (S5008).
     *
     * Mécanique : RXNEIE est armé JUSTE avant de s'endormir et désarmé par le
     * handler (hw_info.c). L'IT ne sert qu'au réveil ; c'est la condition du `while`
     * qui reste la source de vérité, et `DR` n'est lu qu'ici. Le va-et-vient sur
     * RXNEIE est indispensable : si l'IT restait armée avec RXNE actif, le cœur
     * ferait du tail-chaining sans jamais revenir en mode thread lire l'octet.
     * `dsb` garantit que l'écriture du registre a pris effet avant le `wfi`. */
    while (!(USART3->SR & USART_SR_RXNE)) {
        USART3->CR1 |= USART_CR1_RXNEIE;
        __asm volatile ("dsb");
        __asm volatile ("wfi");
    }
    USART3->CR1 &= ~USART_CR1_RXNEIE;
    NVIC_ICPR1 = (1UL << (USART3_IRQn - 32U));   /* purge l'IT déjà servie */
    return (uint8_t)USART3->DR;
#else
    while (!(USART3->SR & (1U << 5))) {}   /* attendre RXNE */
    return (uint8_t)USART3->DR;
#endif
}

static void uart_send_byte(uint8_t b)
{
    while (!(USART3->SR & (1U << 7))) {}   /* attendre TXE */
    USART3->DR = b;
}
#else
/* Mocks définis dans tests/test_pipeline.c */
extern uint8_t uart_getbyte(void);
extern void    uart_send_byte(uint8_t b);
#endif

/* CRC8 polynomial 0x07 — identique à sensor_sim.py */
static uint8_t proto_crc8(const uint8_t *d, int len)
{
    uint8_t crc = 0;
    for (int i = 0; i < len; i++) {
        crc ^= d[i];
        for (int j = 0; j < 8; j++)
            crc = (crc & 0x80U) ? (uint8_t)((crc << 1) ^ 0x07U) : (uint8_t)(crc << 1);
    }
    return crc;
}

/* Réponse v2 : 14 B = [pred:u8][conf:f32][lat_us:u32][ram_b:u16][thr:u16][status:u8] */
static void uart_send_response_v2(uint8_t pred, float conf,
                                   uint32_t lat_us, uint8_t status)
{
    (void)lat_us;   /* lat_us encodé via profiling_encode() ci-dessous */
    union { float f; uint8_t b[4]; } uc;
    uint8_t buf[PROFILING_ENCODED_SIZE];   /* 8 B : [lat_us][ram_b][thr] */

