lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
    profiling_encode(buf);

    /* pred */
    uart_send_byte(pred);

    /* conf (f32 little-endian) */
    uc.f = conf;
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    /* lat_us (u32 little-endian) — depuis profiling */
    uart_send_byte(buf[0]); uart_send_byte(buf[1]);
    uart_send_byte(buf[2]); uart_send_byte(buf[3]);

    /* ram_used_b (u16 little-endian) */
    uart_send_byte(buf[4]); uart_send_byte(buf[5]);

    /* throughput (u16 little-endian) */
    uart_send_byte(buf[6]); uart_send_byte(buf[7]);

    /* status */
    uart_send_byte(status);
}

/* Réponse v3 : 23 B = [pred:u8][conf:f32][lat_us:u32][ram_b:u16][acc:f32][auroc:f32][forgetting:f32] */
static void uart_send_response_v3(uint8_t pred, float conf,
                                   uint32_t lat_us, uint8_t status,
                                   const MetricsSnapshot *snap)
{
    (void)lat_us;   /* lat_us encodé via profiling_encode() */
    (void)status;   /* non utilisé en v3 — métriques portent l'info */
    union { float f; uint8_t b[4]; } uc;
    uint8_t prof_buf[PROFILING_ENCODED_SIZE];   /* 8 B */
    uint8_t snap_buf[METRICS_SNAPSHOT_SIZE];    /* 12 B */

    profiling_encode(prof_buf);
    metrics_encode_snapshot(snap, snap_buf);

    /* pred */
    uart_send_byte(pred);

    /* conf (f32 little-endian) */
    uc.f = conf;
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    /* lat_us (u32 little-endian) — depuis profiling */
    uart_send_byte(prof_buf[0]); uart_send_byte(prof_buf[1]);
    uart_send_byte(prof_buf[2]); uart_send_byte(prof_buf[3]);

    /* ram_b (u16 little-endian) — taille .bss calculée au link time */
    uart_send_byte(prof_buf[4]); uart_send_byte(prof_buf[5]);

    /* MetricsSnapshot — 12 B : [acc:f32][auroc:f32][forgetting:f32] */
    for (int i = 0; i < (int)METRICS_SNAPSHOT_SIZE; i++)
        uart_send_byte(snap_buf[i]);
}

/* Sprint 27 — Réponse 25 B pour DUAL_MODE
 * Layout : [pred_fault:u8][conf_fault:f32][rul_pred:f32][lat_us:u32]
 *          [f1_macro:f32][rmse_rul:f32][forgetting:f32]             */
static void uart_send_response_dual(uint8_t pred_fault, float conf_fault,
                                     float rul_pred, float f1_macro,
                                     float rmse_rul, float forgetting)
{
    union { float f; uint8_t b[4]; } uc;
    uint8_t prof_buf[PROFILING_ENCODED_SIZE];
    profiling_encode(prof_buf);

    uart_send_byte(pred_fault);         /* offset 0 — classe faute prédite */

    uc.f = conf_fault;                  /* offset 1–4 — confiance softmax */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    uc.f = rul_pred;                    /* offset 5–8 — RUL prédit (float) */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    /* offset 9–12 — latence combinée DWT (u32, µs) */
    uart_send_byte(prof_buf[0]); uart_send_byte(prof_buf[1]);
    uart_send_byte(prof_buf[2]); uart_send_byte(prof_buf[3]);

    uc.f = f1_macro;                    /* offset 13–16 — F1-macro faute */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    uc.f = rmse_rul;                    /* offset 17–20 — RMSE RUL */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    uc.f = forgetting;                  /* offset 21–24 — forgetting moyen */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);
    /* Total : 1 + 4 + 4 + 4 + 4 + 4 + 4 = 25 B */
}

/* Sprint 30 — Réponse 22 B pour PAIR_MODE (Mahalanobis + supervisé)
 * Layout : [pred_maha:u8][score_maha:f32][pred_sup:u8][conf_sup:f32]
 *          [lat_us:u32][auroc_maha:f32][f1_sup:f32]                     */
static void uart_send_response_pair(uint8_t pred_maha, float score_maha,
                                    uint8_t pred_sup, float conf_sup,
                                    float auroc_maha, float f1_sup)
{
    union { float f; uint8_t b[4]; } uc;
    uint8_t prof_buf[PROFILING_ENCODED_SIZE];
    profiling_encode(prof_buf);

    uart_send_byte(pred_maha);          /* offset 0 — anomalie Mahalanobis */

    uc.f = score_maha;                  /* offset 1–4 — score Mahalanobis */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    uart_send_byte(pred_sup);           /* offset 5 — classe supervisée */

    uc.f = conf_sup;                    /* offset 6–9 — confiance supervisée */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    /* offset 10–13 — latence combinée DWT (u32, µs) */
    uart_send_byte(prof_buf[0]); uart_send_byte(prof_buf[1]);
    uart_send_byte(prof_buf[2]); uart_send_byte(prof_buf[3]);

    uc.f = auroc_maha;                  /* offset 14–17 — AUROC en ligne Maha */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    uc.f = f1_sup;                      /* offset 18–21 — F1 en ligne supervisé */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);
    /* Total : 1 + 4 + 1 + 4 + 4 + 4 + 4 = 22 B */
}

/* Sprint 31 — Réponse 27 B pour TRIPLE_MODE (PAIR + méta-modèle de stacking)
 * Layout : [pred_maha:u8][score_maha:f32][pred_sup:u8][conf_sup:f32][lat_us:u32]
 *          [auroc_maha:f32][f1_sup:f32]   ← identique PAIR (22 B)
 *          [pred_meta:u8][prob_meta:f32]  ← verdict méta (5 B)                  */
static void uart_send_response_triple(uint8_t pred_maha, float score_maha,
                                      uint8_t pred_sup, float conf_sup,
                                      float auroc_maha, float f1_sup,
                                      uint8_t pred_meta, float prob_meta)
{
    union { float f; uint8_t b[4]; } uc;
    uint8_t prof_buf[PROFILING_ENCODED_SIZE];
    profiling_encode(prof_buf);

    uart_send_byte(pred_maha);          /* offset 0 */

    uc.f = score_maha;                  /* offset 1–4 */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

