lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
    uart_send_byte(pred_sup);           /* offset 5 */

    uc.f = conf_sup;                    /* offset 6–9 */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    /* offset 10–13 — latence combinée DWT (u32, µs) */
    uart_send_byte(prof_buf[0]); uart_send_byte(prof_buf[1]);
    uart_send_byte(prof_buf[2]); uart_send_byte(prof_buf[3]);

    uc.f = auroc_maha;                  /* offset 14–17 */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    uc.f = f1_sup;                      /* offset 18–21 */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);

    uart_send_byte(pred_meta);          /* offset 22 — verdict méta */

    uc.f = prob_meta;                   /* offset 23–26 — proba méta */
    uart_send_byte(uc.b[0]); uart_send_byte(uc.b[1]);
    uart_send_byte(uc.b[2]); uart_send_byte(uc.b[3]);
    /* Total : 22 + 1 + 4 = 27 B */
}

/* ── LED ─────────────────────────────────────────────────────────────────── */

void led_set(int state)
{
#ifndef TEST_MODE
    if (state) {
        GPIOA->BSRR = (1U << LED_PIN);           /* PA5 HIGH — anomalie */
    } else {
        GPIOA->BSRR = (1U << (LED_PIN + 16U));   /* PA5 LOW  — normal   */
    }
#else
    (void)state;
#endif
}

/* ── Normalisation Z-score (stats figées en Flash) ─────────────────────── */

static void normalize_zscore(float *x, int dim)
{
    for (int i = 0; i < dim; i++) {
        x[i] = (x[i] - ZSCORE_MEAN[i]) / ZSCORE_STD[i];
    }
}

/* ── Réception trame UART v2 avec synchronisation MAGIC + vérification CRC */

void uart_receive_sample(float *buf)
{
    uint8_t payload[3U + 4U + 1U + PROTO_MAX_N * 4U + 2U];  /* header étendu */
    int pay_idx = 0;

resync:
    while (uart_getbyte() != PROTO_MAGIC0) {}
    if (uart_getbyte() != PROTO_MAGIC1) goto resync;

    payload[pay_idx++] = PROTO_MAGIC0;
    payload[pay_idx++] = PROTO_MAGIC1;

    g_recv_version = uart_getbyte();
    payload[pay_idx++] = g_recv_version;
    if (g_recv_version != PROTO_VERSION_V2 && g_recv_version != PROTO_VERSION_V3) goto resync;

    g_recv_task_id = uart_getbyte();
    payload[pay_idx++] = g_recv_task_id;

    /* TIMESTAMP_MS : 4 octets little-endian */
    g_recv_timestamp_ms = 0U;
    for (int k = 0; k < 4; k++) {
        uint8_t b = uart_getbyte();
        payload[pay_idx++] = b;
        g_recv_timestamp_ms |= ((uint32_t)b << (k * 8U));
    }

    uint8_t n = uart_getbyte();
    payload[pay_idx++] = n;
    if (n > PROTO_MAX_N) goto resync;

    /* features */
    for (uint8_t i = 0; i < n; i++) {
        union { float f; uint8_t b[4]; } u;
        for (int k = 0; k < 4; k++) {
            u.b[k] = uart_getbyte();
            payload[pay_idx++] = u.b[k];
        }
        if (i < PROTO_MAX_N) buf[i] = u.f;
    }
    for (uint8_t i = n; i < PROTO_MAX_N; i++) buf[i] = 0.0f;

    uint8_t label = uart_getbyte();
    payload[pay_idx++] = label;
    g_recv_label = label;

    g_recv_flags = uart_getbyte();
    payload[pay_idx++] = g_recv_flags;

    uint8_t recv_crc = uart_getbyte();
    if (proto_crc8(payload, pay_idx) != recv_crc) goto resync;
}

/* ── pipeline_set_task ──────────────────────────────────────────────────── */

void pipeline_set_task(uint8_t task_id)
{
    g_current_task_id = task_id;
}

/* ── Init pipeline ─────────────────────────────────────────────────────── */

/* S3205 : initialise g_ewc_head. Si des poids entraînés sont fournis en Flash
 * (model_weights_ewc.h régénéré par export_weights_c.py --ewc), on les charge
 * pour garantir la parité board↔PC ; sinon on retombe sur l'init Xavier
 * historique (apprentissage en ligne — aucune régression). */
static void ewc_head_load_or_init(EWCHead *h)
{
    ewc_init(h);   /* Xavier + zero fisher/star (préserve lambda) */
/* S3507 : poids exportés copiables quand EWC_IN == dim native du header généré
 * (EWC_HEAD_NATIVE_DIM, écrit par export_weights_c.py --ewc-head pour la condition).
 * Sinon (header absent / dim incohérente) → Xavier (apprentissage en ligne). */
#if defined(EWC_HEAD_WEIGHTS_PROVIDED) && (EWC_IN == EWC_HEAD_NATIVE_DIM)
    memcpy(h->w1, EWC_W1_INIT, sizeof(h->w1));
    memcpy(h->b1, EWC_B1_INIT, sizeof(h->b1));
    memcpy(h->w2, EWC_W2_INIT, sizeof(h->w2));
    memcpy(h->b2, EWC_B2_INIT, sizeof(h->b2));
    memcpy(h->w3, EWC_W3_INIT, sizeof(h->w3));
    memcpy(h->b3, EWC_B3_INIT, sizeof(h->b3));
    /* θ* = poids chargés (référence EWC pour la consolidation online) */
    memcpy(h->star_w1, EWC_W1_INIT, sizeof(h->star_w1));
    memcpy(h->star_w2, EWC_W2_INIT, sizeof(h->star_w2));
    memcpy(h->star_w3, EWC_W3_INIT, sizeof(h->star_w3));
#endif
}

void pipeline_init(void)
{
    maha_init(&g_detector, MAHA_THRESHOLD_INIT, MAHA_EMA_ALPHA);
    g_ewc_head.lambda = 400.0f;   /* configs/board_ewc.yaml : EWC_LAMBDA */
    ewc_head_load_or_init(&g_ewc_head);
    ewc_int8_init(&g_ewc_int8);
    /* Sprint 26 : nouvelles têtes EWC régression + multi-classes */
    g_ewc_reg.lambda = 400.0f;
    ewc_reg_init(&g_ewc_reg);
    /* Charger poids entraînés depuis Flash (model_weights_rul.h — export_weights_ewc_rul.py) */
    memcpy(g_ewc_reg.w1, EWC_REG_W1_INIT, sizeof(g_ewc_reg.w1));
    memcpy(g_ewc_reg.b1, EWC_REG_B1_INIT, sizeof(g_ewc_reg.b1));
    memcpy(g_ewc_reg.w2, EWC_REG_W2_INIT, sizeof(g_ewc_reg.w2));
    memcpy(g_ewc_reg.b2, EWC_REG_B2_INIT, sizeof(g_ewc_reg.b2));
    memcpy(g_ewc_reg.w3, EWC_REG_W3_INIT, sizeof(g_ewc_reg.w3));
    memcpy(g_ewc_reg.b3, EWC_REG_B3_INIT, sizeof(g_ewc_reg.b3));

    g_ewc_mc.lambda = 400.0f;
    ewc_mc_init(&g_ewc_mc);
    /* Charger poids entraînés depuis Flash (model_weights_multiclass.h — export_weights_ewc_multiclass.py) */
    memcpy(g_ewc_mc.w1, EWC_MC_W1_INIT, sizeof(g_ewc_mc.w1));
    memcpy(g_ewc_mc.b1, EWC_MC_B1_INIT, sizeof(g_ewc_mc.b1));
    memcpy(g_ewc_mc.w2, EWC_MC_W2_INIT, sizeof(g_ewc_mc.w2));
    memcpy(g_ewc_mc.b2, EWC_MC_B2_INIT, sizeof(g_ewc_mc.b2));
    memcpy(g_ewc_mc.w3, EWC_MC_W3_INIT, sizeof(g_ewc_mc.w3));
    memcpy(g_ewc_mc.b3, EWC_MC_B3_INIT, sizeof(g_ewc_mc.b3));
    online_rmse_init(&g_rmse);
    online_f1_init(&g_f1);
    /* Sprint 31 — méta-modèle stacking (poids depuis meta_weights.h via export_weights_c.py) */
    meta_init(&g_meta);
    /* Sprint 36 (S3610) : charger la tête INT8 depuis les poids FP32 entraînés (résout
     * TODO(dorra)). Sans cela, le chemin 0x40 (FRAME_FLAGS_INT8_MODE) exécutait une tête
     * Xavier non entraînée. ewc_head_load_or_init() a déjà rempli g_ewc_head ci-dessus
     * (poids exportés si EWC_HEAD_WEIGHTS_PROVIDED, Xavier en fallback → 0 régression
     * FP32). La conversion ne touche que g_ewc_int8 ; le chemin FP32 reste inchangé. */
    ewc_int8_from_fp32(&g_ewc_int8, &g_ewc_head);
#ifdef EWC_INT8_V2
    /* Sprint 39 (S3915) : quantifie la tête FP32 entraînée (g_ewc_head) en INT8 v2 avec
     * scales par-canal + bornes d'activation calibrées. act_max provient du header généré
     * (EWC_V2_ACT_MAX) ; à défaut (header vide) → bornes unitaires neutres. Le QMAX dépend
     * de la variante (int8/q15/mixed) → on passe act_max brut, pas scale_act figé.
     * Parité par construction avec l'émulateur forward_quant(per_channel_int8|q15). */
#if defined(EWC_INT8_V2_WEIGHTS_PROVIDED)
    g_v2_act_max[0] = EWC_V2_ACT_MAX[0]; g_v2_act_max[1] = EWC_V2_ACT_MAX[1];
    g_v2_act_max[2] = EWC_V2_ACT_MAX[2];
#else
    g_v2_act_max[0] = 1.0f; g_v2_act_max[1] = 1.0f; g_v2_act_max[2] = 1.0f;
#endif
    ewc_int8_v2_from_fp32_calib(&g_ewc_int8_v2, &g_ewc_head, g_v2_act_max);
#endif
#if defined(EWC_SUBINT8_WEIGHTS_PROVIDED)
    /* Sprint 48 (S4804) — charge la tête sub-INT8 pré-quantifiée depuis le header généré.
     * Les poids sont figés côté PC (ternaire/binaire non reproductibles on-board) → copie
     * directe (parité par construction avec l'émulateur subint8). Les scales d'activation
     * calibrés (EWC_SUB_SCALE_ACT_*) alimentent scale_act_* du kernel v2. */
#if defined(EWC_INTx_PACKED)
    memcpy(g_ewc_subint8_packed.w1, EWC_SUB_W1, sizeof(EWC_SUB_W1));
    memcpy(g_ewc_subint8_packed.w2, EWC_SUB_W2, sizeof(EWC_SUB_W2));
    memcpy(g_ewc_subint8_packed.w3, EWC_SUB_W3, sizeof(EWC_SUB_W3));
    memcpy(g_ewc_subint8_packed.scale_w1, EWC_SUB_SCALE_W1, sizeof(EWC_SUB_SCALE_W1));
    memcpy(g_ewc_subint8_packed.scale_w2, EWC_SUB_SCALE_W2, sizeof(EWC_SUB_SCALE_W2));
    memcpy(g_ewc_subint8_packed.scale_w3, EWC_SUB_SCALE_W3, sizeof(EWC_SUB_SCALE_W3));
    memcpy(g_ewc_subint8_packed.b1, EWC_SUB_B1, sizeof(EWC_SUB_B1));
    memcpy(g_ewc_subint8_packed.b2, EWC_SUB_B2, sizeof(EWC_SUB_B2));
    memcpy(g_ewc_subint8_packed.b3, EWC_SUB_B3, sizeof(EWC_SUB_B3));
    g_ewc_subint8_packed.scale_act_in = EWC_SUB_SCALE_ACT_IN;
    g_ewc_subint8_packed.scale_act_h1 = EWC_SUB_SCALE_ACT_H1;
    g_ewc_subint8_packed.scale_act_h2 = EWC_SUB_SCALE_ACT_H2;
#else
    memcpy(g_ewc_subint8.w1, EWC_SUB_W1, sizeof(EWC_SUB_W1));
    memcpy(g_ewc_subint8.w2, EWC_SUB_W2, sizeof(EWC_SUB_W2));
    memcpy(g_ewc_subint8.w3, EWC_SUB_W3, sizeof(EWC_SUB_W3));
    memcpy(g_ewc_subint8.scale_w1, EWC_SUB_SCALE_W1, sizeof(EWC_SUB_SCALE_W1));
    memcpy(g_ewc_subint8.scale_w2, EWC_SUB_SCALE_W2, sizeof(EWC_SUB_SCALE_W2));
    memcpy(g_ewc_subint8.scale_w3, EWC_SUB_SCALE_W3, sizeof(EWC_SUB_SCALE_W3));
    memcpy(g_ewc_subint8.b1, EWC_SUB_B1, sizeof(EWC_SUB_B1));
    memcpy(g_ewc_subint8.b2, EWC_SUB_B2, sizeof(EWC_SUB_B2));
    memcpy(g_ewc_subint8.b3, EWC_SUB_B3, sizeof(EWC_SUB_B3));
    g_ewc_subint8.scale_act_in = EWC_SUB_SCALE_ACT_IN;
    g_ewc_subint8.scale_act_h1 = EWC_SUB_SCALE_ACT_H1;
    g_ewc_subint8.scale_act_h2 = EWC_SUB_SCALE_ACT_H2;
#endif
#endif
    hdc_init(&g_hdc);
#ifdef EWC_AUTO_UPDATE
    /* S3803 — gate de mise à jour autonome : seuils depuis inc/drift_thresholds.h
     * (généré par export_weights_c.py, neutres par défaut → 0 déclenchement). */
    drift_init(&g_drift, DRIFT_WINDOW_SIZE, DRIFT_FAULT_THRESHOLD,
               DRIFT_DRIFT_THRESHOLD, DRIFT_RATIO);
    g_n_updates = 0;
    g_last_verdict = DRIFT_NORMAL;   /* S3805 */
#endif
#ifdef DRIFT_DETECT
    /* S4502 — init du détecteur porté depuis inc/drift_methods_params.h (généré par
     * export_weights_c.py --drift-methods, valeurs neutres par défaut → aucun déclenchement). */
#if DRIFT_METHOD == DRIFT_PSI
    {
        static const float k_psi_edges[] = PSI_BIN_EDGES;
        static const float k_psi_ref[]   = PSI_REF_PROBS;
        psi_init(&g_drift_method, PSI_REF_BINS, PSI_BLOCK_SIZE_PARAM,
                 PSI_THRESHOLD_PARAM, k_psi_edges, k_psi_ref);
    }
#elif DRIFT_METHOD == DRIFT_DDM
    ddm_init(&g_drift_method, DDM_WARN_SIGMA, DDM_DRIFT_SIGMA, DRIFT_MIN_INSTANCES);
#else
    ph_init(&g_drift_method, PAGE_HINKLEY_DELTA, PAGE_HINKLEY_LAMBDA, DRIFT_MIN_INSTANCES);
#endif
    g_drift_method_verdict = DM_NORMAL;
    g_drift_method_alarms  = 0;
#endif
    /* S3403 — buffer de streaming instrumenté (ring_buffer générique, taille STREAM_BUF_W) */
    ring_buffer_init(&g_stream_rb, (uint8_t *)g_stream_storage,
                     (int)(PROTO_MAX_N * sizeof(float)), STREAM_BUF_W);
    /* proj initialisée depuis model_weights.h ou générée avec LCG seed fixe :
     * TODO(dorra): mettre les poids de projection en Flash (RODATA) pour économiser 20 Ko SRAM */
    /* Sprint 29 — modèles INT8 firmware */
    hdc_int8_init(&g_hdc_int8);
    tinyol_int8_init(&g_tinyol_int8);
    oto_int8_init(&g_oto_int8);
    acc_init(&g_acc);
    auroc_init(&g_auroc);
    fgt_init(&g_fgt);
    g_current_task_id = 0U;

