lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
#if (MAHA_DIM == MAHA_NATIVE_DIM)
    /* Poids Mahalanobis exportés (parité board↔PC) — dim de la condition. */
    for (int i = 0; i < MAHA_DIM; i++) {
        g_detector.mean[i] = MAHA_MEAN_INIT[i];
        for (int j = 0; j < MAHA_DIM; j++) {
            g_detector.precision[i][j] = MAHA_PRECISION_INIT[i][j];
        }
    }
#else
    /* MAHA_DIM ≠ dim native : init neutre (maha_init() a déjà posé identité+0).
     * Poids réels regénérés par condition en S3507. */
#endif

    /* Sprint 34 — Mahalanobis Q15 : init neutre puis poids exportés si fournis (S3407).
     * Sans header généré (MAHA_Q15_WEIGHTS_PROVIDED non défini) → identité, 0 régression. */
    maha_q15_init(&g_maha_q15, MAHA_THRESHOLD_INIT, MAHA_EMA_ALPHA);
#if defined(MAHA_Q15_WEIGHTS_PROVIDED) && (MAHA_Q15_N_FEATURES == MAHA_Q15_NATIVE_DIM)
    g_maha_q15.mu_scale        = MAHA_Q15_MU_SCALE;
    g_maha_q15.mu_zp           = MAHA_Q15_MU_ZP;
    g_maha_q15.sigma_inv_scale = MAHA_Q15_SIGMA_SCALE;
    g_maha_q15.threshold       = MAHA_Q15_THRESHOLD;
    for (int i = 0; i < MAHA_Q15_N_FEATURES; i++) {
        g_maha_q15.mu_q8[i] = MAHA_Q15_MU_Q8[i];
        for (int j = 0; j < MAHA_Q15_N_FEATURES; j++) {
            g_maha_q15.sigma_inv_q15[i][j] = MAHA_Q15_SIGMA_INV[i][j];
        }
    }
#endif

#ifdef MAHA_INT8
    /* Sprint 29 — Mahalanobis INT8 : init neutre puis poids exportés si fournis (S2912).
     * Sans header généré (MAHA_INT8_WEIGHTS_PROVIDED non défini) → identité, 0 régression. */
    maha_int8_init(&g_maha_int8, MAHA_THRESHOLD_INIT, MAHA_EMA_ALPHA);
#if defined(MAHA_INT8_WEIGHTS_PROVIDED) && (MAHA_INT8_N_FEATURES == MAHA_INT8_NATIVE_DIM)
    g_maha_int8.mu_scale        = MAHA_INT8_MU_SCALE;
    g_maha_int8.mu_zp           = MAHA_INT8_MU_ZP;
    g_maha_int8.sigma_inv_scale = MAHA_INT8_SIGMA_SCALE;
    g_maha_int8.sigma_inv_zp    = MAHA_INT8_SIGMA_ZP;
    g_maha_int8.threshold       = MAHA_INT8_THRESHOLD;
    for (int i = 0; i < MAHA_INT8_N_FEATURES; i++) {
        g_maha_int8.mu_q8[i] = MAHA_INT8_MU_Q8[i];
        for (int j = 0; j < MAHA_INT8_N_FEATURES; j++) {
            g_maha_int8.sigma_inv_q8[i][j] = MAHA_INT8_SIGMA_INV[i][j];
        }
    }
#endif
#endif

#if (TINYOL_IN == TINYOL_NATIVE_DIM)
    /* Init TinyOL depuis Flash — poids générés par scripts/export_weights_tinyol.py
     * à la dim de la condition (TINYOL_NATIVE_DIM). */
    memcpy(g_tinyol_enc.w_enc1, TINYOL_W_ENC1, sizeof(g_tinyol_enc.w_enc1));
    memcpy(g_tinyol_enc.b_enc1, TINYOL_B_ENC1, sizeof(g_tinyol_enc.b_enc1));
    memcpy(g_tinyol_enc.w_enc2, TINYOL_W_ENC2, sizeof(g_tinyol_enc.w_enc2));
    memcpy(g_tinyol_enc.b_enc2, TINYOL_B_ENC2, sizeof(g_tinyol_enc.b_enc2));
    memcpy(g_tinyol_dec.w_dec1, TINYOL_W_DEC1, sizeof(g_tinyol_dec.w_dec1));
    memcpy(g_tinyol_dec.b_dec1, TINYOL_B_DEC1, sizeof(g_tinyol_dec.b_dec1));
    memcpy(g_tinyol_dec.w_dec2, TINYOL_W_DEC2, sizeof(g_tinyol_dec.w_dec2));
    memcpy(g_tinyol_dec.b_dec2, TINYOL_B_DEC2, sizeof(g_tinyol_dec.b_dec2));
#else
    /* TINYOL_IN ≠ TINYOL_NATIVE_DIM : encodeur/décodeur restent à zéro (.bss).
     * Régénérer les poids à la bonne dim :
     *   python scripts/export_weights_tinyol.py --dataset <ds> --condition <cond> */
#endif

#ifndef TEST_MODE
    /* Activer GPIOA pour LED LD2 */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
    GPIOA->MODER &= ~(0x3U << (LED_PIN * 2U));
    GPIOA->MODER |=  (0x1U << (LED_PIN * 2U));   /* Output mode */
    GPIOA->OTYPER &= ~(0x1U << LED_PIN);          /* Push-pull */
#endif

    ENERGY_MARKER_INIT();              /* S3304 — PA8 marqueur phase (no-op si flag absent) */
    energy_marker_phase(PHASE_STARTUP);
}

#ifdef TEST_MODE
/* Expose uart_send_response_v2 pour test direct de la taille de trame */
void test_pipeline_send_response_v2(uint8_t pred, float conf,
                                     uint32_t lat_us, uint8_t status)
{
    uart_send_response_v2(pred, conf, lat_us, status);
}

/* Expose uart_send_response_v3 pour test direct de la taille de trame */
void test_pipeline_send_response_v3(uint8_t pred, float conf,
                                     uint32_t lat_us, uint8_t status,
                                     const MetricsSnapshot *snap)
{
    uart_send_response_v3(pred, conf, lat_us, status, snap);
}

/* Sprint 27 — Expose uart_send_response_dual pour test taille trame */
void test_pipeline_send_response_dual(uint8_t pred_fault, float conf_fault,
                                       float rul_pred, float f1_macro,
                                       float rmse_rul, float forgetting)
{
    uart_send_response_dual(pred_fault, conf_fault, rul_pred,
                             f1_macro, rmse_rul, forgetting);
}

/* Sprint 30 — Expose uart_send_response_pair pour test taille trame */
void test_pipeline_send_response_pair(uint8_t pred_maha, float score_maha,
                                      uint8_t pred_sup, float conf_sup,
                                      float auroc_maha, float f1_sup)
{
    uart_send_response_pair(pred_maha, score_maha, pred_sup, conf_sup,
                             auroc_maha, f1_sup);
}
#endif

/* ── Boucle par lot (S5302, extension) ─────────────────────────────────── */
/* INFER_BATCH_N est défini dans pipeline.h (valeur par défaut 1) afin que les tests
 * hôte compilent contre la même valeur que l'unité de traduction. */

#if INFER_BATCH_N > 1
#ifdef TEST_MODE
/* Branche empruntée par le dernier appel à `infer_extra` — TEST uniquement.
 * Elle rend le contrat de portée du lot vérifiable : c'est un défaut d'ATTRIBUTION
 * (le mauvais noyau consomme les µJ), pas un défaut d'état, donc aucune assertion
 * sur les poids ne pourrait le détecter. */
int g_infer_extra_branch = -1;
#define BATCH_BRANCH(x) do { g_infer_extra_branch = (x); } while (0)
#else
#define BATCH_BRANCH(x) do { } while (0)
#endif
/*
 * infer_extra — exécute une inférence SUPPLÉMENTAIRE, sans effet de bord.
 *
 * POURQUOI : le plafond de cadence du banc est l'UART (55 B par transaction à
 * 115200 bauds ⇒ ~209 Hz), pas le modèle. À cette cadence, EWC occupe ~1 % du temps
 * et Mahalanobis ~0,1 % : leur coût est noyé sous le bruit, et aucun balayage de
 * cadence ne peut l'en sortir (mesuré, S5304 : le témoin Mahalanobis rend 60,6 µJ,
 * qui est le coût d'une trame, pas celui du calcul). Exécuter N inférences par trame
 * rend le taux d'occupation réglable INDÉPENDAMMENT de l'UART, et le µJ par inférence
 * s'obtient alors par régression sur N à cadence fixe.
 *
 * CE QU'ELLE NE FAIT PAS, et c'est essentiel : ni mise à jour CL, ni métrique, ni
 * réponse. La passe qui produit la prédiction reste la chaîne existante, inchangée,
 * exécutée en dernier ⇒ prédiction identique à N=1 et UNE SEULE mise à jour CL sous
 * `--update` (sinon la sémantique du continual learning changerait avec N).
 *
 * L'entrée est recopiée : plusieurs chemins normalisent `raw` en place, et une
 * modification ici décalerait la passe finale.
 *
 * PORTÉE — les 8 cellules de la campagne énergie (EWC, HDC, TinyOL, Mahalanobis ×
 * FP32/INT8), c'est-à-dire exactement les couples de `STREAM_MODEL`
 * (scripts/run_s50_board_current.py). Les modes composés (PAIR 0x90/0xA0/0xB0,
 * TRIPLE 0xD0/0xE0, DUAL 0x70, Q15 0xF0) ne sont PAS mis en lot : ils sortent sans
 * aucune passe supplémentaire.
 *
 * C'est un CONTRAT, pas une coïncidence — et il doit être écrit ici parce que la
 * boucle de lot s'exécute AVANT les sorties anticipées de ces modes dans
 * `pipeline_run` : sans exclusion explicite, une trame composée exécuterait N−1
 * passes d'un AUTRE modèle que celui qu'elle mesure (la prédiction resterait juste
 * — la passe finale est la vraie chaîne — mais les µJ seraient attribués au mauvais
 * noyau). Même piège de dispatch que dans `pipeline_run` : le nibble de mode se
 * teste en ÉGALITÉ, pas par masque de sous-ensemble (0xF0 & 0x60 == 0x60 sinon).
 */
static void infer_extra(const float *raw_in)
{
    float raw[PROTO_MAX_N];   /* MEM: 64 B @ FP32 (stack) — copie de travail */
    for (int i = 0; i < (int)PROTO_MAX_N; i++) raw[i] = raw_in[i];

    /* (1) Modes composés → hors périmètre du lot, aucune passe supplémentaire. */
    uint8_t mode = (uint8_t)(g_recv_flags & PROTO_PAIR_MODE_MASK);
    if (mode == PROTO_FLAG_MAHA_Q15         ||
        mode == PROTO_FLAG_TRIPLE_MAHA_EWC  || mode == PROTO_FLAG_TRIPLE_MAHA_HDC  ||
        mode == PROTO_FLAG_PAIR_MAHA_EWC    || mode == PROTO_FLAG_PAIR_MAHA_HDC    ||
        mode == PROTO_FLAG_PAIR_MAHA_TINYOL || mode == PROTO_FLAG_DUAL_MODE) {
        BATCH_BRANCH(BATCH_BRANCH_NONE);
        return;
    }

    /* (2) Nibbles à égalité stricte, dans l'ordre de `pipeline_run` : multiclasse
     *     (0x30) et RUL (0x50) ont leurs propres têtes — les router sur `ewc_forward`
     *     mesurerait un troisième modèle. */
    if (mode == PROTO_FLAG_MULTICLASS_MODE) {
        BATCH_BRANCH(BATCH_BRANCH_MULTICLASS);
        float logits[EWC_MC_N_CLASSES];   /* MEM: N×4 B (stack) */
        ewc_mc_forward(&g_ewc_mc, raw, logits);
        (void)logits;
    } else if (mode == PROTO_FLAG_RUL_MODE) {
        BATCH_BRANCH(BATCH_BRANCH_RUL);
        (void)ewc_reg_predict(&g_ewc_reg, raw);
    } else if ((g_recv_flags & PROTO_FLAG_HDC_INT8) == PROTO_FLAG_HDC_INT8) {
        BATCH_BRANCH(BATCH_BRANCH_HDC_INT8);
        hdc_int8_encode(&g_hdc_int8, raw, g_hv_int8);
        (void)hdc_int8_predict(&g_hdc_int8, g_hv_int8);
    } else if ((g_recv_flags & PROTO_FLAG_TINYOL_INT8) == PROTO_FLAG_TINYOL_INT8) {
        BATCH_BRANCH(BATCH_BRANCH_TINYOL_INT8);
        uint8_t emb_u8[TINYOL_EMB];
        tinyol_int8_encode(&g_tinyol_int8, raw, emb_u8);
        (void)oto_int8_predict(&g_oto_int8, emb_u8);
    } else if (g_recv_flags & PROTO_FLAG_EWC_MODE) {
        BATCH_BRANCH(BATCH_BRANCH_EWC);
        float logits[EWC_OUT];
        ewc_forward(&g_ewc_head, raw, logits);
        (void)logits;
    } else if (g_recv_flags & PROTO_FLAG_INT8_MODE) {
        BATCH_BRANCH(BATCH_BRANCH_EWC_INT8);
        float logits[EWC_OUT];
#if defined(EWC_SUBINT8_WEIGHTS_PROVIDED)
#if defined(EWC_INTx_PACKED)
        ewc_subint8_packed_forward(&g_ewc_subint8_packed, raw, logits);
#else
        ewc_int8_v2_forward(&g_ewc_subint8, raw, logits);
#endif
#elif defined(EWC_INT8_V2)
        ewc_int8_v2_forward(&g_ewc_int8_v2, raw, logits);
#else
        int8_t x_q7[EWC_IN];
        for (int i = 0; i < EWC_IN; i++) x_q7[i] = float_to_q7(raw[i]);
        ewc_int8_forward(&g_ewc_int8, x_q7, logits);
#endif
        (void)logits;
    } else if (g_recv_flags & PROTO_FLAG_HDC_MODE) {
        BATCH_BRANCH(BATCH_BRANCH_HDC);
        float hv[HDC_DIM];   /* MEM: 4 Ko @ FP32 (stack) */
        hdc_encode(&g_hdc, raw, hv);
        (void)hdc_predict(&g_hdc, hv);
    } else if (g_recv_flags & PROTO_FLAG_TINYOL_MODE) {
        BATCH_BRANCH(BATCH_BRANCH_TINYOL);
        float emb[TINYOL_EMB];
        float recon[TINYOL_OUT];
        tinyol_encode(&g_tinyol_enc, raw, emb);
        tinyol_decode(&g_tinyol_dec, emb, recon);
        (void)tinyol_reconstruction_error(raw, recon, (int)TINYOL_OUT);
    } else {
        BATCH_BRANCH(BATCH_BRANCH_MAHA);
        normalize_zscore(raw, MAHA_DIM);
#ifdef MAHA_INT8
        (void)maha_int8_score(&g_maha_int8, raw);
#else
        (void)maha_score(&g_detector, raw);
#endif
    }
}
#endif /* INFER_BATCH_N > 1 */

/* ── Boucle principale ─────────────────────────────────────────────────── */

