lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
void pipeline_run(void)
{
    /* PROTO_MAX_N=16 > EWC_MC_IN(9) > MAHA_DIM(5) — buffer commun pour tous les modes */
    float raw[PROTO_MAX_N];   /* MEM: 64 B @ FP32 (stack) */

    energy_marker_phase(PHASE_ACQUISITION);   /* S3304 — début réception trame */
    uart_receive_sample(raw);

    /* S3403 — remplissage du buffer de streaming instrumenté (hors chrono d'inférence). */
    ring_buffer_push(&g_stream_rb, raw);

    /* RESET : réinitialise EWC avant une nouvelle expérience.
     * raw[0] encode la nouvelle valeur lambda (> 0 pour la modifier). */
    if (g_recv_flags & PROTO_FLAG_RESET) {
        float new_lambda = raw[0];
        if (new_lambda > 0.0f) g_ewc_head.lambda = new_lambda;
        ewc_head_load_or_init(&g_ewc_head);
        acc_init(&g_acc);
        auroc_init(&g_auroc);
        fgt_init(&g_fgt);
        g_current_task_id = 0U;
        MetricsSnapshot snap_reset = { .accuracy = 0.0f, .auroc = 0.0f, .forgetting = 0.0f };
        uart_send_response_v3(0, 1.0f, 0U, PROTO_STATUS_OK, &snap_reset);
        energy_marker_phase(PHASE_IDLE);   /* S3304 */
        return;
    }

    energy_marker_phase(PHASE_INFERENCE);   /* S3304 — corrélé au DWT (profiling_start adjacent) */
    profiling_start();   /* Démarre le chrono DWT */

#if INFER_BATCH_N > 1
    /* S5302 — N−1 inférences supplémentaires DANS la fenêtre chronométrée : la latence
     * DWT rapportée couvre donc le lot entier, ce qui donne le contrôle de cohérence
     * (latence ≈ N × latence unitaire) face à la régression de courant sur N. Le pilote
     * reporte N dans la cellule JSON — jamais supposé côté hôte. */
    for (int b = 0; b < INFER_BATCH_N - 1; b++) {
        infer_extra(raw);
    }
#endif

    int   pred;
    float confidence;

    /* ── MAHA_Q15_MODE (0xF0) : Mahalanobis seul, sigma_inv int16 Q15 (S3407) ──────
     * DOIT passer AVANT TRIPLE/PAIR/DUAL/MULTICLASS : 0xF0 & 0x70 == 0x70 (DUAL) et
     * 0xF0 & 0x30 == 0x30 (MULTICLASS) matcheraient sinon. Exact-match sur le nibble
     * (masque 0xF0). Réponse V3 (23 B) — aucun nouveau format. mu reste fixe (pas d'EMA :
     * mu quantifié), parité avec MahalanobisDetectorInt8.anomaly_score_q15 (PC). */
    if ((uint8_t)(g_recv_flags & PROTO_PAIR_MODE_MASK) == PROTO_FLAG_MAHA_Q15) {
        normalize_zscore(raw, MAHA_DIM);
        float score   = maha_q15_score(&g_maha_q15, raw);
        int   anomaly = (score > g_maha_q15.threshold) ? 1 : 0;
        led_set(anomaly ? LED_ON : LED_OFF);
        confidence = 1.0f / (1.0f + score);

        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
            g_current_task_id = g_recv_task_id;
        auroc_update(&g_auroc, score, (int)g_recv_label);
        acc_update(&g_acc, anomaly, (int)g_recv_label);
        fgt_update(&g_fgt, g_current_task_id, acc_compute(&g_acc));

        profiling_stop();

        MetricsSnapshot snap;
        snap.accuracy   = acc_compute(&g_acc);
        snap.auroc      = auroc_compute(&g_auroc);
        snap.forgetting = fgt_avg_forgetting(&g_fgt);
        uart_send_response_v3((uint8_t)anomaly, confidence,
                              profiling_get_latency_us(), PROTO_STATUS_OK, &snap);
        energy_marker_phase(PHASE_IDLE);   /* S3304 */
        return;
    }

    /* ── TRIPLE_MODE (0xD0/0xE0) : PAIR (Maha + supervisé) + méta-modèle ───────
     * Sprint 31 (S3106). Les 2 sorties de base alimentent meta_head → verdict final.
     * DOIT passer AVANT PAIR/DUAL/MULTICLASS (exact-match sur le nibble de mode).
     * Feature méta = [p_maha, p_sup, disagreement, conf_sup] (ordre DEFAULT_FEATURES,
     * cf. src/ensemble/meta_learner.py), toutes ∈ [0, 1] → pas de scaler embarqué.
     *   p_maha = sigmoid(score - seuil)  (parité ModelPair._maha_proba)
     *   p_sup  : EWC → softmax classe 1 ; HDC → label (HDC sans predict_proba côté PC) */
#if META_N_FEATURES != 4
#error "TRIPLE_MODE attend META_N_FEATURES == 4 ([p_maha, p_sup, disagreement, conf_sup])"
#endif
    uint8_t triple_mode = (uint8_t)(g_recv_flags & PROTO_TRIPLE_MODE_MASK);
    if (triple_mode == PROTO_FLAG_TRIPLE_MAHA_EWC ||
        triple_mode == PROTO_FLAG_TRIPLE_MAHA_HDC) {

        /* (1) Détecteur Mahalanobis sur copie z-scorée */
        float maha_x[MAHA_DIM];   /* MEM: 20 B @ FP32 (stack) */
        memcpy(maha_x, raw, sizeof(maha_x));
        normalize_zscore(maha_x, MAHA_DIM);
        float maha_score_v = maha_score(&g_detector, maha_x);
        int   pred_maha = (maha_score_v > g_detector.threshold) ? 1 : 0;
        float p_maha = 1.0f / (1.0f + expf(-(maha_score_v - g_detector.threshold)));

        /* (2) Modèle supervisé sur raw brut → pred_sup + p_sup ∈ [0, 1] */
        int   pred_sup = 0;
        float p_sup = 0.0f;

        if (triple_mode == PROTO_FLAG_TRIPLE_MAHA_EWC) {
            float logits[EWC_OUT];   /* MEM: 8 B @ FP32 (stack) */
            ewc_forward(&g_ewc_head, raw, logits);
            pred_sup = (logits[1] > logits[0]) ? 1 : 0;
            float e0 = expf(logits[0]);
            float e1 = expf(logits[1]);
            p_sup = e1 / (e0 + e1);            /* proba classe 1 = _supervised_proba (EWC) */
            if (g_recv_flags & PROTO_FLAG_UPDATE)
                ewc_sgd_step(&g_ewc_head, raw, (int)g_recv_label);
            if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
                ewc_consolidate(&g_ewc_head, EWC_FISHER_DECAY);
        } else { /* PROTO_FLAG_TRIPLE_MAHA_HDC */
            float hv[HDC_DIM];   /* MEM: 4 Ko @ FP32 (stack) */
            hdc_encode(&g_hdc, raw, hv);
            pred_sup = hdc_predict(&g_hdc, hv);
            p_sup = (float)pred_sup;           /* HDC sans predict_proba → label sert de proba (PC) */
            if (g_recv_flags & PROTO_FLAG_UPDATE)
                hdc_update_with_sample(&g_hdc, raw, hv, (int)g_recv_label);
            if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
                hdc_binarize(&g_hdc);
        }

        /* (3) Méta-modèle : arbitrage des 2 sorties → verdict final */
        float feats[META_N_FEATURES];
        feats[0] = p_maha;
        feats[1] = p_sup;
        feats[2] = (pred_maha != pred_sup) ? 1.0f : 0.0f;   /* disagreement */
        feats[3] = fabsf(p_sup - 0.5f) * 2.0f;              /* conf_sup */
        float prob_meta = meta_forward(&g_meta, feats);
        int   pred_meta = (prob_meta > 0.5f) ? 1 : 0;

        /* (4) Mise à jour détecteur + LED pilotée par le verdict méta */
        if ((g_recv_flags & PROTO_FLAG_UPDATE) && !pred_maha)
            maha_update(&g_detector, maha_x);
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
            g_current_task_id = g_recv_task_id;
        led_set(pred_meta ? LED_ON : LED_OFF);

        /* (5) Métriques en ligne : AUROC (Maha) + F1 (verdict méta) */
        auroc_update(&g_auroc, maha_score_v, (int)g_recv_label);
        online_f1_update(&g_f1, pred_meta, (int)g_recv_label);

        profiling_stop();

        uart_send_response_triple((uint8_t)pred_maha, maha_score_v,
                                  (uint8_t)pred_sup, p_sup,
                                  auroc_compute(&g_auroc),
                                  online_f1_get(&g_f1),
                                  (uint8_t)pred_meta, prob_meta);
        energy_marker_phase(PHASE_IDLE);   /* S3304 */
        return;
    }

    /* ── PAIR_MODE (0x90/0xA0/0xB0) : Mahalanobis + supervisé {EWC,HDC,TinyOL} ──
     * Généralisation Sprint 30 du DUAL_MODE. DOIT passer AVANT DUAL/MULTICLASS :
     * les valeurs de nibble 0x9_/0xA_/0xB_ sont libres, mais on respecte la règle
     * « exact-match (sur le nibble de mode) avant subset ».
     *   Mahalanobis : raw[0..MAHA_DIM-1] z-scoré (copie — ne pas clobber raw)
     *   Supervisé   : raw brut (parité avec les chemins single-mode)            */
    uint8_t pair_mode = (uint8_t)(g_recv_flags & PROTO_PAIR_MODE_MASK);
    if (pair_mode == PROTO_FLAG_PAIR_MAHA_EWC ||
        pair_mode == PROTO_FLAG_PAIR_MAHA_HDC ||
        pair_mode == PROTO_FLAG_PAIR_MAHA_TINYOL) {

        /* (1) Détecteur Mahalanobis sur copie z-scorée */
        float maha_x[MAHA_DIM];   /* MEM: 20 B @ FP32 (stack) */
        memcpy(maha_x, raw, sizeof(maha_x));
        normalize_zscore(maha_x, MAHA_DIM);
        float maha_score_v = maha_score(&g_detector, maha_x);
        int   pred_maha = (maha_score_v > g_detector.threshold) ? 1 : 0;

        /* (2) Modèle supervisé sur raw brut, selon le sous-mode */
        int   pred_sup = 0;
        float conf_sup = 0.0f;

