lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
        if (pair_mode == PROTO_FLAG_PAIR_MAHA_EWC) {
            float logits[EWC_OUT];   /* MEM: 8 B @ FP32 (stack) */
            ewc_forward(&g_ewc_head, raw, logits);
            pred_sup = (logits[1] > logits[0]) ? 1 : 0;
            float e0 = expf(logits[0]);
            float e1 = expf(logits[1]);
            conf_sup = e1 / (e0 + e1);
            if (g_recv_flags & PROTO_FLAG_UPDATE)
                ewc_sgd_step(&g_ewc_head, raw, (int)g_recv_label);
            if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
                ewc_consolidate(&g_ewc_head, EWC_FISHER_DECAY);
        } else if (pair_mode == PROTO_FLAG_PAIR_MAHA_HDC) {
            float hv[HDC_DIM];   /* MEM: 4 Ko @ FP32 (stack) — cf. FIXME(gap2) HDC single */
            hdc_encode(&g_hdc, raw, hv);
            pred_sup = hdc_predict(&g_hdc, hv);
            float score = 0.0f;
            for (int i = 0; i < HDC_DIM; i++) score += g_hdc.am[pred_sup][i] * hv[i];
            conf_sup = (score / (float)HDC_DIM + 1.0f) / 2.0f;
            if (g_recv_flags & PROTO_FLAG_UPDATE)
                hdc_update_with_sample(&g_hdc, raw, hv, (int)g_recv_label);
            if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
                hdc_binarize(&g_hdc);
        } else { /* PROTO_FLAG_PAIR_MAHA_TINYOL */
            float emb[16];   /* MEM: 64 B (stack) */
            float recon[EWC_IN];
            tinyol_encode(&g_tinyol_enc, raw, emb);
            tinyol_decode(&g_tinyol_dec, emb, recon);
            float mse = tinyol_reconstruction_error(raw, recon, EWC_IN);
            pred_sup = (mse > TINYOL_THRESHOLD) ? 1 : 0;
            conf_sup = 1.0f / (1.0f + mse);
            /* update OtO non disponible en C bare-metal (no-op, cf. chemin single) */
        }

        /* (3) Mise à jour du détecteur + LED pilotée par l'anomalie */
        if ((g_recv_flags & PROTO_FLAG_UPDATE) && !pred_maha)
            maha_update(&g_detector, maha_x);
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
            g_current_task_id = g_recv_task_id;
        led_set(pred_maha ? LED_ON : LED_OFF);

        /* (4) Métriques en ligne : AUROC (Maha, score) + F1 (supervisé) */
        auroc_update(&g_auroc, maha_score_v, (int)g_recv_label);
        online_f1_update(&g_f1, pred_sup, (int)g_recv_label);

        profiling_stop();

        uart_send_response_pair((uint8_t)pred_maha, maha_score_v,
                                 (uint8_t)pred_sup, conf_sup,
                                 auroc_compute(&g_auroc),
                                 online_f1_get(&g_f1));
        energy_marker_phase(PHASE_IDLE);   /* S3304 */
        return;
    }

    /* ── DUAL_MODE (0x70) : EWC_REG (RUL) + EWC_MC (faute) ────────────────────
     * DOIT ÊTRE EN PREMIER — 0x70 & 0x30 == 0x30 matcherait MULTICLASS sinon
     * Encodage labels :
     *   g_recv_task_id = fault_label ∈ [0, EWC_MC_N_CLASSES-1]
     *   g_recv_label   = rul_u8 = round(RUL / 300 × 255) → re-normalisé en [0,1]
     * Features :
     *   raw[0..4] → g_ewc_reg  (EWC_REG_IN = 5)
     *   raw[0..8] → g_ewc_mc   (EWC_MC_IN  = 9) */
    if ((g_recv_flags & PROTO_FLAG_DUAL_MODE) == PROTO_FLAG_DUAL_MODE) {
        uint8_t fault_label    = g_recv_task_id;
        float   rul_label_norm = (float)g_recv_label / 255.0f;

        float rul_pred = ewc_reg_predict(&g_ewc_reg, raw);

        float logits[EWC_MC_N_CLASSES];   /* MEM: N×4 B stack */
        ewc_mc_forward(&g_ewc_mc, raw, logits);
        int fault_pred = ewc_mc_predict(&g_ewc_mc, raw);

        float max_l = logits[0];
        for (int j = 1; j < EWC_MC_N_CLASSES; j++)
            if (logits[j] > max_l) max_l = logits[j];
        float sum_exp = 0.0f;
        for (int j = 0; j < EWC_MC_N_CLASSES; j++)
            sum_exp += expf(logits[j] - max_l);
        float conf_fault = expf(logits[fault_pred] - max_l) / sum_exp;

        if (g_recv_flags & PROTO_FLAG_UPDATE) {
            ewc_reg_sgd_step(&g_ewc_reg, raw, rul_label_norm);
            ewc_mc_sgd_step(&g_ewc_mc, raw, (int)fault_label);
        }
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            ewc_reg_consolidate(&g_ewc_reg, EWC_REG_FISHER_DECAY);
            ewc_mc_consolidate(&g_ewc_mc, EWC_MC_FISHER_DECAY);
            g_current_task_id++;
        }

        online_rmse_update(&g_rmse, rul_pred, rul_label_norm);
        online_f1_update(&g_f1, fault_pred, (int)fault_label);

        profiling_stop();

        uart_send_response_dual(
            (uint8_t)fault_pred, conf_fault, rul_pred,
            online_f1_get(&g_f1),
            online_rmse_get(&g_rmse),
            fgt_avg_forgetting(&g_fgt)
        );
        energy_marker_phase(PHASE_IDLE);   /* S3304 */
        return;
    }

    if ((g_recv_flags & PROTO_FLAG_MULTICLASS_MODE) == PROTO_FLAG_MULTICLASS_MODE) {
        /* ── Chemin EWC Multi-class (EWC_MODE|HDC_MODE = 0x30) ─────────────── */
        float logits[EWC_MC_N_CLASSES];   /* MEM: N×4 B stack */
        ewc_mc_forward(&g_ewc_mc, raw, logits);
        pred = ewc_mc_predict(&g_ewc_mc, raw);

        /* Confiance = softmax[pred] numériquement stable */
        float max_l = logits[0];
        for (int j = 1; j < EWC_MC_N_CLASSES; j++)
            if (logits[j] > max_l) max_l = logits[j];
        float sum_exp = 0.0f;
        for (int j = 0; j < EWC_MC_N_CLASSES; j++) sum_exp += expf(logits[j] - max_l);
        confidence = expf(logits[pred] - max_l) / sum_exp;

        if (g_recv_flags & PROTO_FLAG_UPDATE)
            ewc_mc_sgd_step(&g_ewc_mc, raw, (int)g_recv_label);
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            ewc_mc_consolidate(&g_ewc_mc, EWC_MC_FISHER_DECAY);
            g_current_task_id = g_recv_task_id;
        }
        online_f1_update(&g_f1, pred, (int)g_recv_label);

    } else if ((g_recv_flags & PROTO_FLAG_RUL_MODE) == PROTO_FLAG_RUL_MODE) {
        /* ── Chemin EWC Régression RUL (EWC_MODE|INT8_MODE = 0x50) ─────────── */
        float rul_pred = ewc_reg_predict(&g_ewc_reg, raw);
        pred       = 0;
        confidence = rul_pred;   /* champ conf transporte le RUL prédit */

