lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
        /* label_u8 ∈ [0,255] encodé par simulate_rul_board.py (RUL/RUL_CAP × 255)
         * → re-normaliser en [0,1] pour correspondre à la target d'entraînement */
        float rul_label_norm = (float)g_recv_label / 255.0f;
        if (g_recv_flags & PROTO_FLAG_UPDATE)
            ewc_reg_sgd_step(&g_ewc_reg, raw, rul_label_norm);
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            ewc_reg_consolidate(&g_ewc_reg, EWC_REG_FISHER_DECAY);
            g_current_task_id = g_recv_task_id;
        }
        online_rmse_update(&g_rmse, rul_pred, rul_label_norm);

    } else if ((g_recv_flags & PROTO_FLAG_HDC_INT8) == PROTO_FLAG_HDC_INT8) {
        /* ── Chemin HDC INT8 (HDC_MODE|INT8_MODE = 0x60) ──────────────────────
         * DOIT passer avant le check INT8_MODE (0x40) : 0x60 & 0x40 == 0x40. */
        hdc_int8_encode(&g_hdc_int8, raw, g_hv_int8);
        pred = hdc_int8_predict(&g_hdc_int8, g_hv_int8);

        /* Confiance : dot(am[pred], hv) normalisé par (HDC_I_D × max|am|) → [0, 1] */
        int32_t score = 0;
        for (int i = 0; i < HDC_I_D; i++)
            score += (int32_t)g_hdc_int8.am[pred][i] * (int32_t)g_hv_int8[i];
        confidence = (float)score / (float)HDC_I_D;
        confidence = (confidence + 1.0f) / 2.0f;   /* recentrage approximatif [0,1] */

        if (g_recv_flags & PROTO_FLAG_UPDATE)
            hdc_int8_update(&g_hdc_int8, g_hv_int8, (int)g_recv_label);
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
            g_current_task_id = g_recv_task_id;   /* HDC additif : pas de binarize */
        auroc_update(&g_auroc, confidence, (int)g_recv_label);

    } else if ((g_recv_flags & PROTO_FLAG_TINYOL_INT8) == PROTO_FLAG_TINYOL_INT8) {
        /* ── Chemin TinyOL INT8 (TINYOL_MODE|INT8_MODE = 0xC0) ────────────────
         * DOIT passer avant le check INT8_MODE (0x40) : 0xC0 & 0x40 == 0x40. */
        uint8_t emb_u8[TINYOL_EMB];   /* MEM: 16 B @ UINT8 stack */
        tinyol_int8_encode(&g_tinyol_int8, raw, emb_u8);
        pred       = oto_int8_predict(&g_oto_int8, emb_u8);
        confidence = g_oto_int8.last_prob;

        if (g_recv_flags & PROTO_FLAG_UPDATE)
            oto_int8_update(&g_oto_int8, emb_u8, (int)g_recv_label);
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE)
            g_current_task_id = g_recv_task_id;
        auroc_update(&g_auroc, confidence, (int)g_recv_label);

    } else if (g_recv_flags & PROTO_FLAG_EWC_MODE) {
        /* ── Chemin EWC : forward softmax + update SGD + consolidation ─────── */
        float logits[EWC_OUT];   /* MEM: 8 B @ FP32 (stack) */
        ewc_forward(&g_ewc_head, raw, logits);
        pred = (logits[1] > logits[0]) ? 1 : 0;

        float e0 = expf(logits[0]);
        float e1 = expf(logits[1]);
        confidence = e1 / (e0 + e1);   /* prob(faulty=1) pour AUROC */

#ifdef DRIFT_DETECT
        /* S4502 — détecteur de drift (build-time). Signal selon la famille (S4501) :
         * PSI (non-supervisé) sur le score Maha déjà calculable ; PH/DDM (supervisés)
         * sur le flux d'erreur 1[pred != label]. Aucune adaptation du modèle — on mesure
         * la détection. Verdict remonté via snap.auroc (wire format V3 inchangé). */
        {
#if DRIFT_METHOD == DRIFT_PSI
            float drift_sig = maha_score(&g_detector, raw);
            g_drift_method_verdict = psi_update(&g_drift_method, drift_sig);
#elif DRIFT_METHOD == DRIFT_DDM
            float drift_sig = (pred != (int)g_recv_label) ? 1.0f : 0.0f;
            g_drift_method_verdict = ddm_update(&g_drift_method, drift_sig);
#else
            float drift_sig = (pred != (int)g_recv_label) ? 1.0f : 0.0f;
            g_drift_method_verdict = ph_update(&g_drift_method, drift_sig);
#endif
            if (g_drift_method_verdict == DM_DRIFT) g_drift_method_alarms++;
        }
#endif

#ifdef EWC_AUTO_UPDATE
        /* ── Gate autonome (S3803) : remplace le déclencheur humain PROTO_FLAG_UPDATE.
         * Le score Mahalanobis nourrit le détecteur de dérive ; le verdict décide à
         * bord QUAND et AVEC QUEL label mettre à jour. Protocole UART inchangé. */
        {
            float s = maha_score(&g_detector, raw);
            DriftVerdict v = drift_update(&g_drift, s);
            g_last_verdict = v;   /* S3805 : exposé dans le snapshot (réinterprétation, infra) */
#ifdef GATE_PSEUDO_LABEL
            /* P3 — 100 % autonome (pseudo-label par verdict). */
            if (v == DRIFT_FAULT) {
                ewc_sgd_step(&g_ewc_head, raw, 1);   /* pseudo-label faulty */
                g_n_updates++;
            } else if (v == DRIFT_DRIFT) {
                maha_update(&g_detector, raw);        /* adapte le normal (pas de SGD faute) */
            }
#else
            /* P2 — active learning : vrai label sur déclenchement du gate. */
            if (v != DRIFT_NORMAL) {
                ewc_sgd_step(&g_ewc_head, raw, (int)g_recv_label);
                g_n_updates++;
            }
#endif
        }
#else
        if (g_recv_flags & PROTO_FLAG_UPDATE) {
            ewc_sgd_step(&g_ewc_head, raw, (int)g_recv_label);
        }
#endif
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            ewc_consolidate(&g_ewc_head, EWC_FISHER_DECAY);
            g_current_task_id = g_recv_task_id;
        }
        auroc_update(&g_auroc, confidence, (int)g_recv_label);
    } else if (g_recv_flags & PROTO_FLAG_INT8_MODE) {
#if defined(EWC_SUBINT8_WEIGHTS_PROVIDED)
        /* ── Chemin EWC sub-INT8 (S4804) : forward inférence frozen ────────────────
         * Sélectionné par -DEWC_INT4/EWC_INT2/EWC_INT1 (+EWC_SUBINT8_WEIGHTS_PROVIDED),
         * prioritaire sur le v2 (le nibble 0x40 route vers sub-INT8). Poids figés PC ⇒
         * pas d'update online (S48 isole le schéma de quantification). Déquant→FP32 sur
         * FPU = parité bit-à-bit avec l'émulateur subint8. */
        float logits[EWC_OUT];   /* MEM: 8 B @ FP32 (stack) */
#if defined(EWC_INTx_PACKED)
        ewc_subint8_packed_forward(&g_ewc_subint8_packed, raw, logits);
#else
        ewc_int8_v2_forward(&g_ewc_subint8, raw, logits);
#endif
        pred = (logits[1] > logits[0]) ? 1 : 0;
        float e0 = expf(logits[0]);
        float e1 = expf(logits[1]);
        confidence = e1 / (e0 + e1);
        auroc_update(&g_auroc, confidence, (int)g_recv_label);
#elif defined(EWC_INT8_V2)
        /* ── Chemin EWC INT8 v2 (S3915) : forward inférence, déquant→FP32 ──────────
         * Sélectionné par -DEWC_INT8_V2 (le nibble 0x40 route vers le v2 au lieu du v1).
         * Le kernel v2 quantifie les activations à bord (scales calibrés) ⇒ on lui passe
         * l'entrée FP32 brute, pas x_q7. */
        float logits[EWC_OUT];   /* MEM: 8 B @ FP32 (stack) */
        ewc_int8_v2_forward(&g_ewc_int8_v2, raw, logits);
        pred = (logits[1] > logits[0]) ? 1 : 0;

        float e0 = expf(logits[0]);
        float e1 = expf(logits[1]);
        confidence = e1 / (e0 + e1);

        /* Update online (S4002) : SGD sur la tête FP32 maître puis requantification v2.
         * g_ewc_head est la source ; g_ewc_int8_v2 en est la vue quantifiée (act_max figé).
         * Le coût de requantification par échantillon est inclus dans la latence DWT (honnête). */
        if (g_recv_flags & PROTO_FLAG_UPDATE) {
            ewc_sgd_step(&g_ewc_head, raw, (int)g_recv_label);
            ewc_int8_v2_from_fp32_calib(&g_ewc_int8_v2, &g_ewc_head, g_v2_act_max);
        }
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            ewc_consolidate(&g_ewc_head, EWC_FISHER_DECAY);
            ewc_int8_v2_from_fp32_calib(&g_ewc_int8_v2, &g_ewc_head, g_v2_act_max);
            g_current_task_id = g_recv_task_id;
        }
        auroc_update(&g_auroc, confidence, (int)g_recv_label);
#else
        /* ── Chemin EWC INT8 v1 : forward Q7 + update Q7 ──────────────────────────── */
        int8_t x_q7[EWC_IN];   /* MEM: EWC_IN B = 5 B (stack) */
        for (int i = 0; i < EWC_IN; i++) {
            x_q7[i] = float_to_q7(raw[i]);
        }

        float logits[EWC_OUT];   /* MEM: 8 B @ FP32 (stack) */
        ewc_int8_forward(&g_ewc_int8, x_q7, logits);
        pred = (logits[1] > logits[0]) ? 1 : 0;

        float e0 = expf(logits[0]);
        float e1 = expf(logits[1]);
        confidence = e1 / (e0 + e1);

