lrivals/cl-embedded/firmware/stm32f4_blink/src/pipeline.c
        if (g_recv_flags & PROTO_FLAG_UPDATE) {
            ewc_int8_update(&g_ewc_int8, x_q7, g_recv_label,
                            0.01f, /* lr = EWC_LR */
                            1      /* fisher_ema = true */);
        }
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            ewc_int8_consolidate(&g_ewc_int8);
            g_current_task_id = g_recv_task_id;
        }
        auroc_update(&g_auroc, confidence, (int)g_recv_label);
#endif
    } else if (g_recv_flags & PROTO_FLAG_HDC_MODE) {
        /* ── Chemin HDC : encode → predict → update si UPDATE → binarize si CONSOLIDATE ── */
        float hv[HDC_DIM];   /* MEM: 4 Ko @ FP32 (stack — vérifier _Min_Stack_Size dans ld) */
        /* FIXME(gap2): hv[HDC_DIM] = 4 Ko sur pile — valider suffisance pile MCU */
        hdc_encode(&g_hdc, raw, hv);
        pred = hdc_predict(&g_hdc, hv);

        /* Confiance : dot(am[pred], hv) normalisé par HDC_DIM → [0, 1] */
        float score = 0.0f;
        for (int i = 0; i < HDC_DIM; i++) score += g_hdc.am[pred][i] * hv[i];
        confidence = (score / (float)HDC_DIM + 1.0f) / 2.0f;

        if (g_recv_flags & PROTO_FLAG_UPDATE) {
            hdc_update_with_sample(&g_hdc, raw, hv, (int)g_recv_label);
        }
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            hdc_binarize(&g_hdc);
            g_current_task_id = g_recv_task_id;
        }
        auroc_update(&g_auroc, confidence, (int)g_recv_label);
    } else if (g_recv_flags & PROTO_FLAG_TINYOL_MODE) {
        /* ── Chemin TinyOL autoencoder (anomaly via reconstruction) ─────────── */
        /* MEM: emb[16] = 64 B + recon[TINYOL_IN] = 4·k B (stack) */
        /* S5201 : dimensionné sur TINYOL_IN (et non EWC_IN) — en condition
         * best/all les dims diffèrent par modèle ; tinyol_decode écrit
         * TINYOL_OUT floats, un recon[EWC_IN] plus court débordait la pile. */
        float emb[TINYOL_EMB];
        float recon[TINYOL_OUT];
        tinyol_encode(&g_tinyol_enc, raw, emb);
        tinyol_decode(&g_tinyol_dec, emb, recon);
        float mse = tinyol_reconstruction_error(raw, recon, (int)TINYOL_OUT);
        /* Seuil : depuis model_weights.h (calibré P95×1.5 via export_weights_tinyol.py) */
        pred       = (mse > TINYOL_THRESHOLD) ? 1 : 0;
        confidence = 1.0f / (1.0f + mse);
        led_set(pred ? LED_ON : LED_OFF);

        if (g_recv_flags & PROTO_FLAG_UPDATE) {
            /* Mise à jour OtO : ajuste les poids si pred != label */
            tinyol_encode(&g_tinyol_enc, raw, emb);  /* re-encode pour update */
            (void)emb;  /* update via gradient backward non disponible en C bare-metal — no-op */
        }
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            g_current_task_id = g_recv_task_id;
        }
        auroc_update(&g_auroc, mse, (int)g_recv_label);
    } else {
        /* ── Chemin Mahalanobis (comportement historique) ───────────────────── */
        normalize_zscore(raw, MAHA_DIM);
#ifdef MAHA_INT8
        /* Sprint 29 (S2912) : variante INT8 sélectionnée à la compilation (nibble saturé).
         * Fit offline → pas de maha_update (mu/sigma_inv quantifiés figés). Parité PC. */
        float score = maha_int8_score(&g_maha_int8, raw);
        int   anomaly = (score > g_maha_int8.threshold) ? 1 : 0;
        pred       = anomaly;
        confidence = 1.0f / (1.0f + score);
        led_set(anomaly ? LED_ON : LED_OFF);
#else
        float score = maha_score(&g_detector, raw);
        int   anomaly = (score > g_detector.threshold) ? 1 : 0;
        pred       = anomaly;
        confidence = 1.0f / (1.0f + score);
        led_set(anomaly ? LED_ON : LED_OFF);

        if ((g_recv_flags & PROTO_FLAG_UPDATE) && !anomaly) {
            maha_update(&g_detector, raw);
        }
#endif
        if (g_recv_flags & PROTO_FLAG_CONSOLIDATE) {
            ewc_consolidate(&g_ewc_head, EWC_FISHER_DECAY);
            g_current_task_id = g_recv_task_id;
        }
        auroc_update(&g_auroc, score, (int)g_recv_label);
    }

    profiling_stop();    /* Arrête le chrono, calcule throughput */

    /* acc_update / fgt_update uniquement pour les modes classification */
    if ((g_recv_flags & PROTO_FLAG_RUL_MODE) != PROTO_FLAG_RUL_MODE) {
        acc_update(&g_acc, pred, (int)g_recv_label);
        fgt_update(&g_fgt, g_current_task_id, acc_compute(&g_acc));
    }

    MetricsSnapshot snap;
    if ((g_recv_flags & PROTO_FLAG_MULTICLASS_MODE) == PROTO_FLAG_MULTICLASS_MODE) {
        snap.accuracy   = online_f1_get(&g_f1);
        snap.auroc      = 0.0f;
        snap.forgetting = fgt_avg_forgetting(&g_fgt);
    } else if ((g_recv_flags & PROTO_FLAG_RUL_MODE) == PROTO_FLAG_RUL_MODE) {
        snap.accuracy   = 0.0f;
        snap.auroc      = online_rmse_get(&g_rmse);   /* champ auroc transporte RMSE */
        snap.forgetting = 0.0f;
    } else {
        snap.accuracy   = acc_compute(&g_acc);
        snap.auroc      = auroc_compute(&g_auroc);
        snap.forgetting = fgt_avg_forgetting(&g_fgt);
    }

#ifdef EWC_AUTO_UPDATE
    /* S3805 — réinterprétation du snapshot SOUS LE GATE UNIQUEMENT (wire format V3
     * inchangé : sensor_stream lit toujours [acc][auroc][forgetting]). Le gate doit
     * renvoyer le verdict par échantillon (parité S3806) et le compteur de MAJ réel
     * (économie S3805) ; aucun slot dédié dans la réponse → on réutilise auroc/forgetting.
     * accuracy reste l'accuracy online. Build par défaut strictement inchangé. */
    if (g_recv_flags & PROTO_FLAG_EWC_MODE) {
        snap.auroc      = (float)g_last_verdict;   /* 0=NORMAL,1=FAULT,2=DRIFT */
        snap.forgetting = (float)g_n_updates;      /* compteur cumulé de SGD déclenchés */
    }
#endif

#ifdef DRIFT_DETECT
    /* S4502 — remontée du verdict de drift SOUS -DDRIFT_DETECT UNIQUEMENT (wire format V3
     * inchangé : sensor_stream lit toujours [acc][auroc][forgetting]). auroc ← verdict
     * (0=NORMAL,1=WARNING,2=DRIFT), forgetting ← nb de DRIFT cumulés. accuracy inchangée. */
    if (g_recv_flags & PROTO_FLAG_EWC_MODE) {
        snap.auroc      = (float)g_drift_method_verdict;
        snap.forgetting = (float)g_drift_method_alarms;
    }
#endif

#ifdef INT8_SEGMENT_PROFILE
    /* S5004 — remontée du breakdown latence INT8 SOUS -DINT8_SEGMENT_PROFILE
     * UNIQUEMENT (wire format V3 23 B inchangé : sensor_stream lit toujours
     * [acc][auroc][forgetting], que le driver S50 réinterprète en cycles DWT).
     * Les 3 accumulateurs sont remplis par ewc_int8_v2_forward pour le chemin
     * INT8 (0x40). Build par défaut strictement inchangé (.bss invariant). */
    if (g_recv_flags & PROTO_FLAG_INT8_MODE) {
        snap.accuracy   = (float)g_profiling.seg_dequant_cycles;
        snap.auroc      = (float)g_profiling.seg_mac_cycles;
        snap.forgetting = (float)g_profiling.seg_requant_cycles;
    }
#endif

    uart_send_response_v3((uint8_t)pred, confidence,
                           profiling_get_latency_us(), PROTO_STATUS_OK, &snap);

#ifdef DEBUG_PRINTF
    char dbg[80];
    snprintf(dbg, sizeof(dbg), "score=%.4f pred=%d lat=%lu us\r\n",
             (double)confidence, pred, (unsigned long)profiling_get_latency_us());
    for (int i = 0; dbg[i]; i++) uart_send_byte((uint8_t)dbg[i]);
#endif

    energy_marker_phase(PHASE_IDLE);   /* S3304 — retour en attente UART */
}
